In [121]:
import os
import pandas as pd
import csv

In [122]:
csv_path = os.path.join(os.getcwd(), 'Resources', 'purchase_data.csv')
purchase_df = pd.read_csv(csv_path)

In [123]:
purchase_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [124]:
purchase_df["SN"].value_counts()

Lisosia93        5
Iral74           4
Idastidru52      4
Umolrian85       3
Strithenu87      3
                ..
Yalostiphos68    1
Maridisya31      1
Tyaelo67         1
Jiskjask85       1
Aesur96          1
Name: SN, Length: 576, dtype: int64

In [143]:

total_players = pd.DataFrame(purchase_df, columns=["SN"])

In [146]:
total_players.drop_duplicates()

                SN
0          Lisim78
1      Lisovynya38
2       Ithergue48
3    Chamassasya86
4        Iskosia90
..             ...
773         Hala31
774     Jiskjask80
775     Aethedru70
777     Yathecal72
778        Sisur91

[576 rows x 1 columns]

In [148]:
clean_total_players = total_players.drop_duplicates()

In [149]:
#Total number of players
len(clean_total_players)

576

In [128]:
#Number of Unique Items
unique_items = purchase_df["Item Name"].unique()

In [129]:
len(unique_items)

179

In [130]:
#Average Purchase Price
average_price = purchase_df['Price'].mean()

In [131]:
average_price

3.050987179487176

In [132]:
#Total Number of Purchases
total_purchases = purchase_df['Purchase ID'].unique()
len(total_purchases)

780

In [133]:
#Total Revenue
total_revenue = purchase_df['Price'].sum()

In [134]:
total_revenue

2379.77

In [140]:
gendered_players = pd.DataFrame(purchase_df, columns=[
                        "Gender", "SN"])

In [150]:

merge_df = pd.merge(clean_total_players, gendered_players, on="SN", how="left")

In [154]:
clean_merge_df = merge_df.drop_duplicates()

In [155]:
clean_merge_df

                SN  Gender
0          Lisim78    Male
3      Lisovynya38    Male
4       Ithergue48    Male
5    Chamassasya86    Male
6        Iskosia90    Male
..             ...     ...
775         Hala31    Male
776     Jiskjask80    Male
777     Aethedru70  Female
778     Yathecal72    Male
779        Sisur91    Male

[576 rows x 2 columns]

In [158]:
male_players = 0
for x in clean_merge_df['Gender']:
    if x == 'Male':
        male_players+=1

In [159]:
male_players

484

In [160]:
female_players = 0
for x in clean_merge_df['Gender']:
    if x == 'Female':
        female_players+=1

In [161]:
other_players = 0
for x in clean_merge_df['Gender']:
    if x == 'Other / Non-Disclosed':
        other_players+=1

In [171]:
#Percentage and count of Other/NonDisclosed Players
other_players_percent =  "{:.001%}".format(other_players/len(clean_merge_df['Gender']))

In [173]:

male_players_percent = "{:.001%}".format(male_players/len(clean_merge_df['Gender']))

In [174]:
#Percentage and Count of Female Player
female_players_percent = "{:.001%}".format(female_players/len(clean_merge_df['Gender']))

In [175]:
#Percentage and Count of Male Players
male_players_percent

'84.0%'

In [180]:
male_players

484

In [ ]:
#Percentage and Count of Female Player
female_players_percent

In [178]:
#Percentage and count of Other/NonDisclosed Players
other_players

11

In [179]:
other_players_percent

'1.9%'

In [21]:
#Purchase Count, Average Purcahse Price, Total Purchase Value, and Average Purchase Totale Per Person
#Break Each value down by gender

In [22]:
#Break Values Down into bins of 4 years

In [23]:
#Identify the whales by total purchase values then list(in a table)
#SN
#Purchase Count
#Average Purchase Price
#Total Purchase Value

In [24]:
#Identify the 5 Most Popular Items by Purchase Count, then list(in a table)
#Item ID
#Item Name
#Purchase Count
#Item Price
#Total Purchase Value

In [ ]:
#Identify the 5 Most Profitable Items by total purchase value, then list(in a table)
#Item Id
#Item Name
#Purchase Count
#Item Price
#Total Purchase Value